---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimTextLocationForLeader
source: html/e40d1f99-7d1a-c71e-7194-949bce435d6d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimTextLocationForLeader Property

"Text Location"

## Syntax (C#)
```csharp
public static ForgeTypeId DimTextLocationForLeader { get; }
```